uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <assert.h>
#include <debug.h>
#include <errno.h>
#include <inttypes.h>
#include <stdbool.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <time.h>
#include <sys/types.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/crc32.h>
#include <nuttx/irq.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>

#include "esp32p4_mipi_csi.h"
#include "esp_cache.h"
#include "esp_irq_p4.h"
#include "esp_private/periph_ctrl.h"

#include "hal/mipi_csi_hal.h"
#include "hal/mipi_csi_ll.h"
#include "hal/mipi_csi_periph.h"

#include "hal/dw_gdma_hal.h"
#include "hal/dw_gdma_ll.h"
#include "hal/dw_gdma_types.h"
#include "hal/isp_ll.h"
#include "hal/ldo_ll.h"
#include "hal/clk_gate_ll.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define ESP32P4_CSI_DEFAULT_AFULL_THRD 960
#define ESP32P4_CSI_CACHE_LINE         64
#define ESP32P4_CSI_CACHE_CHUNK        (32 * 1024)
#define ESP32P4_CSI_DMA_IDLE_SPINS     1000

/* MIPI D-PHY power supply: LDO channel 3 (unit index 2), 2500 mV.
 * The LDO must be enabled before mipi_csi_hal_init or the D-PHY will
 * never enter HS mode (hint=0, bdepth=0 symptom).
 */

#define ESP32P4_CSI_MIPI_PHY_LDO_UNIT   2    /* LDO_ID2UNIT(chan_id=3) = 2 */
#define ESP32P4_CSI_MIPI_PHY_LDO_MV     2500 /* 2.5 V for MIPI D-PHY */

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* CSI frame buffer descriptor */

struct esp32p4_csi_buffer_s
{
  FAR uint8_t *raw_buf;      /* Base allocated pointer */
  FAR uint8_t *payload;      /* Frame payload pointer */
  size_t       raw_len;      /* Total allocated length with padding/guard */
  size_t       payload_len;  /* Frame payload length in bytes */
  bool         has_guard;    /* Front/rear guard words enabled */
};

/* ESP32-P4 CSI device structure */

struct esp32p4_csi_dev_s
{
  mutex_t                               lock;
  sem_t                                 dma_sem;
  bool                                  initialized;
  bool                                  enabled;
  mipi_csi_hal_context_t                hal;
  struct esp32p4_mipi_csi_config_s      config;

  /* DMA capture state */

  bool                                  dma_initialized;
  bool                                  dma_running;
  uint8_t                               dma_chan;
  int                                   cpuint;
  dw_gdma_hal_context_t                 dma_hal;
  struct esp32p4_csi_capture_config_s   dma_cfg;

  /* Link list descriptors in SRAM */

  FAR dw_gdma_link_list_item_t         *lli_items;
  size_t                                lli_count;

  /* Frame buffers */

  struct esp32p4_csi_buffer_s           buffers[ESP32P4_CSI_MAX_BUFFERS];
  uint8_t                               buf_count;
  uint8_t                               current_buf_idx;

  /* ISR signaling and stats */

  volatile bool                         frame_ready;
  volatile int                          last_dma_status;
  struct esp32p4_csi_dma_stats_s        stats;
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct esp32p4_csi_dev_s g_csi_dev =
{
  .lock            = NXMUTEX_INITIALIZER,
  .initialized     = false,
  .enabled         = false,
  .dma_initialized = false,
  .dma_running     = false,
  .dma_chan        = 0,
  .cpuint          = -1,
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_get_time_us
 ****************************************************************************/

static uint64_t esp32p4_get_time_us(void)
{
  struct timespec ts;

  clock_systime_timespec(&ts);
  return (uint64_t)ts.tv_sec * 1000000ULL + (uint64_t)ts.tv_nsec / 1000ULL;
}

/****************************************************************************
 * Name: esp32p4_csi_cache_invalidate
 *
 * Description:
 *   Invalidate a large DMA buffer in bounded chunks.  A whole-frame cache
 *   operation can monopolize the external-memory fabric while display DMA
 *   is active, so keep every cache critical section short.
 ****************************************************************************/

static void esp32p4_csi_cache_invalidate(FAR uint8_t *buf, size_t size)
{
  size_t offset;

  for (offset = 0; offset < size; offset += ESP32P4_CSI_CACHE_CHUNK)
    {
      size_t chunk = size - offset;

      if (chunk > ESP32P4_CSI_CACHE_CHUNK)
        {
          chunk = ESP32P4_CSI_CACHE_CHUNK;
        }

      esp_cache_msync(buf + offset, chunk, ESP_CACHE_MSYNC_FLAG_DIR_M2C);
    }
}

/****************************************************************************
 * Name: esp32p4_csi_dma_buffer_addr
 *
 * Description:
 *   Return the MMU/cache address consumed by DW-GDMA.  Unlike LLI metadata,
 *   a data buffer must not be converted to the CPU-only non-cache alias:
 *   DW-GDMA terminates that transaction after the first burst.
 ****************************************************************************/

