uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
static uint32_t esp32p4_csi_dma_buffer_addr(
  FAR struct esp32p4_csi_dev_s *priv, FAR uint8_t *buf)
{
  (void)priv;
  return (uint32_t)(uintptr_t)buf;
}

/****************************************************************************
 * Name: esp32p4_csi_dma_wait_idle
 ****************************************************************************/

static int esp32p4_csi_dma_wait_idle(FAR struct esp32p4_csi_dev_s *priv)
{
  uint32_t mask = 1u << priv->dma_chan;
  int spins = ESP32P4_CSI_DMA_IDLE_SPINS;

  while ((priv->dma_hal.dev->chen0.val & mask) != 0 && --spins > 0)
    {
      up_udelay(1);
    }

  return spins > 0 ? OK : -ETIMEDOUT;
}

/****************************************************************************
 * Name: esp32p4_csi_isp_enable_input
 *
 * Description:
 *   Open the ESP32-P4 rev3 CSI input gate in the shared ISP pipeline.  The
 *   CSI host can be configured correctly while the bridge still receives no
 *   pixels if mipi_data_en remains at its reset value.
 ****************************************************************************/

static void esp32p4_csi_isp_enable_input(
  FAR struct esp32p4_csi_dev_s *priv)
{
  isp_dev_t *isp = ISP_LL_GET_HW(0);
  uint32_t line_words;

  PERIPH_RCC_ATOMIC()
    {
      isp_ll_enable_module_clock(isp, true);
      isp_ll_select_clk_source(isp, ISP_CLK_SRC_XTAL);
      isp_ll_reset_module_clock(isp);
    }

  isp_ll_init(isp);
  isp_ll_enable(isp, false);
  isp_ll_clk_enable(isp, true);
  isp_ll_set_input_data_source(isp, ISP_INPUT_DATA_SOURCE_CSI);
  isp_ll_set_input_data_color_format(isp, ISP_COLOR_RAW10);
  isp_ll_enable_line_start_packet_exist(isp, false);
  isp_ll_enable_line_end_packet_exist(isp, false);

  /* The ISP stays bypassed for packed RAW10 capture, but its CSI input
   * front end must remain clocked on ESP32-P4 rev3.  In bypass mode HSIZE
   * is the number of 32-bit input words per line, not the pixel count.
   */

  line_words = ((uint32_t)priv->config.frame_width * 10 + 31) / 32;
  isp_ll_set_intput_data_h_pixel_num(isp, line_words);
  isp_ll_set_intput_data_v_row_num(isp, priv->config.frame_height);
}

/****************************************************************************
 * Name: esp32p4_csi_bridge_reset
 ****************************************************************************/

static void esp32p4_csi_bridge_reset(FAR struct esp32p4_csi_dev_s *priv)
{
  csi_brg_dev_t *brg = priv->hal.bridge_dev;
  uint32_t frame_words = priv->stats.frame_bytes / sizeof(uint64_t);
  uint32_t bridge_burst = 512;

  while (bridge_burst > 1 && (frame_words % bridge_burst) != 0)
    {
      bridge_burst >>= 1;
    }

  mipi_csi_brg_ll_enable(brg, false);
  brg->csi_en.csi_brg_rst = 1;
  brg->csi_en.csi_brg_rst = 0;

  /* Every bridge request must divide the packed RAW10 frame length.  A
   * fixed 512-word request leaves a non-emitted tail (128 words at 720p,
   * 32 at 1080p).  Pick the largest power-of-two divisor for this mode.
   */

  mipi_csi_brg_ll_set_burst_len(brg, bridge_burst);

  /* Keep bridge-side frame request generation enabled.  DW-GDMA remains
   * self-flow-controlled below so the programmed block length is still a
   * hard destination bound.
   */

  brg->dma_req_cfg.csi_dma_flow_controller = 1;

  /* SC2336 emits normal CSI-2 long packets without embedded HSYNC words. */

  mipi_csi_brg_ll_enable_has_hsync(brg, false);
  mipi_csi_brg_ll_set_data_type_min(brg, 0x12);
  mipi_csi_brg_ll_set_data_type_max(brg, 0x2f);
  mipi_csi_brg_ll_enable_color_conversion(brg, true);
  mipi_csi_brg_ll_set_color_mode_bypass(brg, true);
  mipi_csi_brg_ll_set_intput_data_h_pixel_num(brg,
                                               priv->config.frame_width);
  mipi_csi_brg_ll_set_intput_data_v_row_num(brg,
                                             priv->config.frame_height);
  mipi_csi_brg_ll_set_flow_ctl_buf_afull_thrd(
    brg, ESP32P4_CSI_DEFAULT_AFULL_THRD);
  mipi_csi_brg_ll_set_output_byte_endian(brg,
                                          priv->config.byte_swap_en);
  brg->host_ctrl.csi_enableclk = 1;
  brg->host_ctrl.csi_cfg_clk_en = 1;
  brg->int_clr.val = UINT32_MAX;
}

/****************************************************************************
 * Name: esp32p4_csi_dma_record_errors
 ****************************************************************************/

static int esp32p4_csi_dma_record_errors(
  FAR struct esp32p4_csi_dev_s *priv, uint32_t status)
{
  int ret = OK;

  if ((status & (DW_GDMA_LL_CHANNEL_EVENT_SRC_DEC_ERR |
                 DW_GDMA_LL_CHANNEL_EVENT_DST_DEC_ERR)) != 0)
    {
      priv->stats.dma_err_dec++;
      ret = -EIO;
    }

  if ((status & (DW_GDMA_LL_CHANNEL_EVENT_SRC_SLV_ERR |
                 DW_GDMA_LL_CHANNEL_EVENT_DST_SLV_ERR)) != 0)
    {
      priv->stats.dma_err_slv++;
      ret = -EIO;
    }

  if ((status & DW_GDMA_LL_CHANNEL_EVENT_SHADOWREG_OR_LLI_INVALID_ERR) != 0)
    {
      priv->stats.dma_err_lli++;
      ret = -EINVAL;
    }

  return ret;
}

/****************************************************************************
 * Name: esp32p4_csi_arm_buffer
 ****************************************************************************/

static int esp32p4_csi_arm_buffer(
  FAR struct esp32p4_csi_dev_s *priv,
  FAR struct esp32p4_csi_buffer_s *buf_desc)
{
  dw_gdma_dev_t *dev = priv->dma_hal.dev;
  uint32_t beats = buf_desc->payload_len / sizeof(uint64_t);
  uint32_t dma_dst = esp32p4_csi_dma_buffer_addr(priv,
                                                  buf_desc->payload);
  int ret;

  /* Close and flush the bridge before touching a live DMA channel. */

  if (priv->initialized)
    {
      esp32p4_csi_bridge_reset(priv);
    }

  dw_gdma_ll_channel_enable(dev, priv->dma_chan, false);
  ret = esp32p4_csi_dma_wait_idle(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Drop destination cache lines before granting ownership to DMA. */

  esp32p4_csi_cache_invalidate(buf_desc->payload,
                               buf_desc->payload_len);

  dw_gdma_ll_channel_clear_intr(dev, priv->dma_chan, UINT32_MAX);
  dw_gdma_ll_channel_set_src_addr(dev, priv->dma_chan,
                                  MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_addr(dev, priv->dma_chan,
                                  dma_dst);
  dw_gdma_ll_channel_set_trans_block_size(dev, priv->dma_chan, beats);
  dw_gdma_ll_channel_set_src_master_port(dev, priv->dma_chan,
                                         MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_master_port(dev, priv->dma_chan,
                                         dma_dst);
  dw_gdma_ll_channel_set_src_trans_width(dev, priv->dma_chan,
                                         DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_channel_set_dst_trans_width(dev, priv->dma_chan,
                                         DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_channel_set_src_burst_items(dev, priv->dma_chan,
                                         DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_dst_burst_items(dev, priv->dma_chan,
                                         DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_src_burst_mode(dev, priv->dma_chan,
                                        DW_GDMA_BURST_MODE_FIXED);
  dw_gdma_ll_channel_set_dst_burst_mode(dev, priv->dma_chan,
                                        DW_GDMA_BURST_MODE_INCREMENT);
  dw_gdma_ll_channel_set_src_burst_len(dev, priv->dma_chan, 16);
  dw_gdma_ll_channel_set_dst_burst_len(dev, priv->dma_chan, 16);
  dw_gdma_ll_channel_set_link_list_head_addr(dev, priv->dma_chan, 0);

  priv->frame_ready = false;
  priv->last_dma_status = OK;
  dw_gdma_ll_channel_enable(dev, priv->dma_chan, true);

  if (priv->initialized)
    {
      mipi_csi_brg_ll_enable(priv->hal.bridge_dev, true);
      priv->enabled = true;
    }

  priv->dma_running = true;
  priv->stats.is_capturing = true;
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32p4_mipi_csi_init
 ****************************************************************************/

int esp32p4_mipi_csi_init(FAR const struct
                          esp32p4_mipi_csi_config_s *config)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  mipi_csi_hal_config_t hal_cfg;
  uint8_t dref = 0;
  uint8_t mul = 0;
  bool use_rail_voltage = false;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (config != NULL)
    {
      memcpy(&priv->config, config, sizeof(priv->config));
    }
  else
    {
      priv->config.lanes_num          = ESP32P4_CSI_DEFAULT_LANES;
      priv->config.frame_width        = ESP32P4_CSI_DEFAULT_WIDTH;
      priv->config.frame_height       = ESP32P4_CSI_DEFAULT_HEIGHT;
      priv->config.in_bpp             = ESP32P4_CSI_DEFAULT_BPP;
      priv->config.out_bpp            = ESP32P4_CSI_DEFAULT_BPP;
      priv->config.data_type          = ESP32P4_CSI_DT_RAW10;
      priv->config.byte_swap_en       = false;
      priv->config.lane_bit_rate_mbps = ESP32P4_CSI_DEFAULT_MBPS;
    }

