uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
  /* 0. Enable MIPI D-PHY LDO power supply (Channel 3 -> Unit 2, 2.5 V) */

  ldo_ll_voltage_to_dref_mul(ESP32P4_CSI_MIPI_PHY_LDO_UNIT,
                             ESP32P4_CSI_MIPI_PHY_LDO_MV,
                             &dref, &mul, &use_rail_voltage);
  ldo_ll_adjust_voltage(ESP32P4_CSI_MIPI_PHY_LDO_UNIT, dref, mul,
                        use_rail_voltage);
  ldo_ll_set_owner(ESP32P4_CSI_MIPI_PHY_LDO_UNIT, LDO_LL_UNIT_OWNER_SW);
  ldo_ll_enable_ripple_suppression(ESP32P4_CSI_MIPI_PHY_LDO_UNIT, true);
  ldo_ll_enable(ESP32P4_CSI_MIPI_PHY_LDO_UNIT, true);
  up_udelay(5000);

  /* 1. Enable module clocks and release resets.
   * PHY config clock must be toggled (disable->enable) to generate a
   * proper reset pulse, matching the official ESP-IDF sequence in
   * esp_cam_ctlr_csi.c:s_csi_claim_controller/esp_cam_new_csi_ctlr.
   */

  PERIPH_RCC_ATOMIC()
    {
      clk_gate_ll_ref_20m_clk_en(true);
      mipi_csi_ll_set_phy_clock_source(0, MIPI_CSI_PHY_CLK_SRC_PLL_F20M);
      mipi_csi_ll_enable_phy_config_clock(0, false);
      mipi_csi_ll_enable_phy_config_clock(0, true);
      mipi_csi_ll_enable_host_bus_clock(0, false);
      mipi_csi_ll_enable_host_bus_clock(0, true);
      mipi_csi_ll_reset_host_clock(0);
      mipi_csi_ll_enable_brg_module_clock(0, true);
      mipi_csi_ll_reset_brg_module_clock(0);
      mipi_csi_brg_ll_enable_clock(MIPI_CSI_BRG_LL_GET_HW(0), true);
    }

  /* 2. Configure HAL layer (PHY PLL, Host controller, and Bridge)
   * Note: mipi_csi_hal_init sets h_pixel_num from frame_height and
   * v_row_num from frame_width.
   */

  hal_cfg.lanes_num          = priv->config.lanes_num;
  hal_cfg.frame_height       = priv->config.frame_width;  /* h_pixel_num */
  hal_cfg.frame_width        = priv->config.frame_height; /* v_row_num */
  hal_cfg.in_bpp             = priv->config.in_bpp;
  hal_cfg.out_bpp            = priv->config.out_bpp;
  hal_cfg.byte_swap_en       = priv->config.byte_swap_en;
  hal_cfg.lane_bit_rate_mbps = priv->config.lane_bit_rate_mbps;

  mipi_csi_hal_init(&priv->hal, &hal_cfg);

  /* ESP32-P4 rev3 gates the CSI input through the shared ISP block. */

  esp32p4_csi_isp_enable_input(priv);

  /* Force standard 2-bit VC0 mode
   * (disable 5-bit VCX extension: 1 is disabled)
   */

  priv->hal.host_dev->vc_extension.vcx = 1;

  /* Force CSI Bridge internal clock gating disabled (clock always on) */

  priv->hal.bridge_dev->clk_en.clk_en = 1;

  /* Configure Bridge DMA burst length (512 items per burst). */

  mipi_csi_brg_ll_set_burst_len(priv->hal.bridge_dev, 512);
  priv->hal.bridge_dev->dma_req_cfg.csi_dma_flow_controller = 1;

  /* Enable color management in bypass mode so RAW data passes directly */

  mipi_csi_brg_ll_enable_color_conversion(priv->hal.bridge_dev, true);
  mipi_csi_brg_ll_set_color_mode_bypass(priv->hal.bridge_dev, true);

  /* 3. Configure CSI Bridge frame formatting, data type filtering
   *    and threshold.  The SC2336 stream has CSI-2 line packets but no
   *    embedded HSYNC data in the payload.
   */

  mipi_csi_brg_ll_enable_has_hsync(priv->hal.bridge_dev, false);
  mipi_csi_brg_ll_set_data_type_min(priv->hal.bridge_dev, 0x12);
  mipi_csi_brg_ll_set_data_type_max(priv->hal.bridge_dev, 0x2f);
  priv->hal.bridge_dev->host_ctrl.csi_enableclk  = 1;
  priv->hal.bridge_dev->host_ctrl.csi_cfg_clk_en = 1;

  mipi_csi_brg_ll_set_flow_ctl_buf_afull_thrd(priv->hal.bridge_dev,
                                             ESP32P4_CSI_DEFAULT_AFULL_THRD);
  mipi_csi_brg_ll_set_output_byte_endian(priv->hal.bridge_dev,
                                         priv->config.byte_swap_en);

  /* 4. Unmask CSI Host and Bridge status registers for full diagnostics */

  priv->hal.host_dev->int_msk_phy_fatal.val         = 0;
  priv->hal.host_dev->int_msk_pkt_fatal.val         = 0;
  priv->hal.host_dev->int_msk_phy.val               = 0;
  priv->hal.host_dev->int_msk_bndry_frame_fatal.val = 0;
  priv->hal.host_dev->int_msk_seq_frame_fatal.val   = 0;
  priv->hal.host_dev->int_msk_crc_frame_fatal.val   = 0;
  priv->hal.host_dev->int_msk_pld_crc_fatal.val     = 0;
  priv->hal.host_dev->int_msk_data_id.val           = 0;
  priv->hal.host_dev->int_msk_ecc_corrected.val     = 0;

  priv->hal.bridge_dev->int_ena.val                 = 0x3f;

  /* 5. Disable CSI bridge initially until DMA is armed */

  mipi_csi_brg_ll_enable(priv->hal.bridge_dev, false);

  priv->initialized = true;
  priv->enabled     = false;

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_csi_enable
 ****************************************************************************/

int esp32p4_mipi_csi_enable(bool enable)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  mipi_csi_brg_ll_enable(priv->hal.bridge_dev, enable);
  priv->enabled = enable;

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_csi_get_status
 ****************************************************************************/

int esp32p4_mipi_csi_get_status(FAR struct
                                esp32p4_mipi_csi_status_s *status)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  csi_host_dev_t *host_dev;
  csi_brg_dev_t *brg_dev;
  int ret;

  if (status == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  memset(status, 0, sizeof(*status));
  status->initialized = priv->initialized;
  status->enabled     = priv->enabled;

  if (priv->initialized)
    {
      host_dev = priv->hal.host_dev;
      brg_dev  = priv->hal.bridge_dev;

      status->clk_stopstate  = host_dev->phy_stopstate.phy_stopstateclk;
      status->clk_activehs   = host_dev->phy_rx.phy_rxclkactivehs;
      status->clk_ulpsnot    = host_dev->phy_rx.phy_rxulpsclknot;

