uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
      status->data_stopstate =
        (uint8_t)(host_dev->phy_stopstate.phy_stopstatedata_0 & 0x01) |
        (uint8_t)((host_dev->phy_stopstate.phy_stopstatedata_1 & 0x01) << 1);

      status->data_ulpsesc =
        (uint8_t)(host_dev->phy_rx.phy_rxulpsesc_0 & 0x01) |
        (uint8_t)((host_dev->phy_rx.phy_rxulpsesc_1 & 0x01) << 1);

      status->int_st_main      = host_dev->int_st_main.val;
      status->int_st_phy_fatal = host_dev->int_st_phy_fatal.val;
      status->int_st_pkt_fatal = host_dev->int_st_pkt_fatal.val;
      status->bridge_int_st    = brg_dev->int_st.val;
      status->buffer_depth     = brg_dev->buf_flow_ctl.csi_buf_depth;
    }

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_mipi_csi_dump
 ****************************************************************************/

void esp32p4_mipi_csi_dump(void)
{
  struct esp32p4_mipi_csi_status_s st;
  int ret;

  ret = esp32p4_mipi_csi_get_status(&st);
  if (ret < 0)
    {
      printf("MIPI CSI: get status failed (%d)\n", ret);
      return;
    }

  printf("========================================\n");
  printf(" ESP32-P4 MIPI CSI Controller Status\n");
  printf("========================================\n");
  printf("  Initialized     : %s\n", st.initialized ? "YES" : "NO");
  printf("  Bridge Enabled  : %s\n", st.enabled ? "YES" : "NO");
  printf("  Clock Lane      : %s, %s (ulpsnot=%d)\n",
         st.clk_activehs ? "HS-Active" : "LP/Inactive",
         st.clk_stopstate ? "StopState (LP-11)" : "Active/Transition",
         st.clk_ulpsnot);
  printf("  Data Lane 0     : %s (ulps=%d)\n",
         (st.data_stopstate & 0x01) ? "StopState (LP-11)" : "Active/HS",
         st.data_ulpsesc & 0x01);
  printf("  Data Lane 1     : %s (ulps=%d)\n",
         (st.data_stopstate & 0x02) ? "StopState (LP-11)" : "Active/HS",
         (st.data_ulpsesc >> 1) & 0x01);
  printf("  Host Main INT   : 0x%08" PRIx32 "\n", st.int_st_main);
  printf("  PHY Fatal INT   : 0x%08" PRIx32 "\n", st.int_st_phy_fatal);
  printf("  Packet Fatal INT: 0x%08" PRIx32 "\n", st.int_st_pkt_fatal);
  printf("  Bridge INT      : 0x%08" PRIx32 "\n", st.bridge_int_st);
  printf("  Bridge FIFO Lvl : %u bytes\n", st.buffer_depth);
  printf("========================================\n");
}

/****************************************************************************
 * Name: esp32p4_mipi_csi_deinit
 ****************************************************************************/

int esp32p4_mipi_csi_deinit(void)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->initialized)
    {
      mipi_csi_brg_ll_enable(priv->hal.bridge_dev, false);
      mipi_csi_brg_ll_enable_clock(priv->hal.bridge_dev, false);

      PERIPH_RCC_ATOMIC()
        {
          mipi_csi_ll_enable_brg_module_clock(0, false);
          mipi_csi_ll_enable_host_bus_clock(0, false);
          mipi_csi_ll_enable_phy_config_clock(0, false);
        }

      /* LDO_VO3 supplies both MIPI CSI and MIPI DSI on ESP32-P4.  Keep the
       * rail enabled when stopping CSI so a running display is not blanked.
       * The rail is intentionally left on until reset because the current
       * CSI and DSI drivers do not yet share a common reference counter.
       */

      priv->initialized = false;
      priv->enabled     = false;
    }

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_dma_init
 ****************************************************************************/

int esp32p4_csi_dma_init(FAR const struct
                         esp32p4_csi_capture_config_s *config)
{
  FAR struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  dw_gdma_dev_t *dev;
  size_t frame_bytes;
  size_t words_count;
  size_t guard_size;
  size_t total_buf_size;
  uint8_t chan;
  uint8_t count;
  int ret;
  int i;

  if (config == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->dma_initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -EEXIST;
    }

  memcpy(&priv->dma_cfg, config, sizeof(priv->dma_cfg));
  chan  = config->dma_chan;
  count = (config->buf_count > 0 &&
           config->buf_count <= ESP32P4_CSI_MAX_BUFFERS) ?
           config->buf_count : 1;

  priv->dma_chan        = chan;
  priv->buf_count       = count;
  priv->current_buf_idx = 0;
  priv->frame_ready     = false;

  /* Calculate required sizes:
   * frame_bytes = (width * height * bpp) / 8
   */

  frame_bytes = ((size_t)config->frame_width * config->frame_height *
                 config->bpp) / 8;
  if (frame_bytes == 0 || (frame_bytes % 8) != 0)
    {
      nxmutex_unlock(&priv->lock);
      return -EINVAL;
    }

  words_count = frame_bytes / 8; /* 64-bit words for DW-GDMA */
  guard_size  = config->enable_guard ? ESP32P4_CSI_GUARD_SIZE : 0;
  total_buf_size = (frame_bytes + guard_size * 2 + 63) & ~63;

  priv->stats.frame_bytes    = frame_bytes;
  priv->stats.active_channel = chan;

  /* 1. Enable the shared DW-GDMA controller.  Do not reset the global
   * controller here: display or audio can already own another channel.
   */

  PERIPH_RCC_ATOMIC()
    {
      dw_gdma_ll_enable_bus_clock(0, true);
    }

  priv->dma_hal.dev = DW_GDMA_LL_GET_HW(0);
  dev = priv->dma_hal.dev;

  dw_gdma_ll_enable_controller(dev, true);

  /* 2. Allocate 64-byte aligned Link List Item (LLI) descriptors in SRAM */

  priv->lli_items = (FAR dw_gdma_link_list_item_t *)
    kmm_memalign(DW_GDMA_LL_LINK_LIST_ALIGNMENT,
                 sizeof(dw_gdma_link_list_item_t) * count);
  if (priv->lli_items == NULL)
    {
      ret = -ENOMEM;
      goto err_clean;
    }

  memset(priv->lli_items, 0,
         sizeof(dw_gdma_link_list_item_t) * count);
  priv->lli_count = count;

  /* 3. Allocate and initialize frame buffers (SRAM or PSRAM) */

  for (i = 0; i < count; i++)
    {
      FAR uint8_t *buf = NULL;

      if (config->mem_type == ESP32P4_CSI_BUF_PSRAM)
        {
          buf = (FAR uint8_t *)kumm_memalign(64, total_buf_size);
        }
      else
        {
          buf = (FAR uint8_t *)kmm_memalign(64, total_buf_size);
        }

      if (buf == NULL)
        {
          ret = -ENOMEM;
          goto err_clean;
        }

