uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
      memset(buf, 0, total_buf_size);

      priv->buffers[i].raw_buf     = buf;
      priv->buffers[i].raw_len     = total_buf_size;
      priv->buffers[i].payload_len = frame_bytes;
      priv->buffers[i].has_guard   = config->enable_guard;

      if (config->enable_guard)
        {
          priv->buffers[i].payload = buf + guard_size;
          *(FAR uint32_t *)buf = ESP32P4_CSI_GUARD_FRONT;
          *(FAR uint32_t *)(buf + guard_size + frame_bytes) =
            ESP32P4_CSI_GUARD_REAR;
        }
      else
        {
          priv->buffers[i].payload = buf;
        }

      /* Clean/invalidate cache for buffer */

      esp_cache_msync((FAR void *)buf, total_buf_size,
                      ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                      ESP_CACHE_MSYNC_FLAG_INVALIDATE);

      /* Configure LLI item */

      dw_gdma_ll_lli_set_src_addr(&priv->lli_items[i],
                                  MIPI_CSI_BRG_MEM_BASE);
      dw_gdma_ll_lli_set_dst_addr(&priv->lli_items[i],
        esp32p4_csi_dma_buffer_addr(priv, priv->buffers[i].payload));
      dw_gdma_ll_lli_set_trans_block_size(&priv->lli_items[i],
                                          words_count);
      dw_gdma_ll_lli_set_src_master_port(&priv->lli_items[i],
                                         MIPI_CSI_BRG_MEM_BASE);
      dw_gdma_ll_lli_set_dst_master_port(&priv->lli_items[i],
        esp32p4_csi_dma_buffer_addr(priv, priv->buffers[i].payload));
      dw_gdma_ll_lli_set_src_trans_width(&priv->lli_items[i],
                                         DW_GDMA_TRANS_WIDTH_64);
      dw_gdma_ll_lli_set_dst_trans_width(&priv->lli_items[i],
                                         DW_GDMA_TRANS_WIDTH_64);
      dw_gdma_ll_lli_set_src_burst_items(&priv->lli_items[i],
                                         DW_GDMA_BURST_ITEMS_512);
      dw_gdma_ll_lli_set_dst_burst_items(&priv->lli_items[i],
                                         DW_GDMA_BURST_ITEMS_512);
      dw_gdma_ll_lli_set_src_burst_mode(&priv->lli_items[i],
                                        DW_GDMA_BURST_MODE_FIXED);
      dw_gdma_ll_lli_set_dst_burst_mode(&priv->lli_items[i],
                                        DW_GDMA_BURST_MODE_INCREMENT);
      dw_gdma_ll_lli_set_src_burst_len(&priv->lli_items[i], 16);
      dw_gdma_ll_lli_set_dst_burst_len(&priv->lli_items[i], 16);

      dw_gdma_ll_lli_set_block_markers(&priv->lli_items[i],
                                       true, (i == count - 1), true);

      dw_gdma_ll_lli_set_link_list_master_port(
        &priv->lli_items[i],
        DW_GDMA_LL_MASTER_PORT_MEMORY);

      if (i + 1 < count)
        {
          dw_gdma_ll_lli_set_next_item_addr(&priv->lli_items[i],
            (uint32_t)&priv->lli_items[i + 1]);
        }
      else
        {
          dw_gdma_ll_lli_set_next_item_addr(&priv->lli_items[i], 0);
        }
    }

  /* Sync LLI descriptors to memory */

  esp_cache_msync((FAR void *)priv->lli_items,
                  sizeof(dw_gdma_link_list_item_t) * count,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M |
                  ESP_CACHE_MSYNC_FLAG_INVALIDATE);

  /* 4. Configure DW-GDMA Channel registers */

  dw_gdma_ll_channel_set_priority(dev, chan, 1);
  dw_gdma_ll_channel_set_trans_flow(dev, chan,
                                    DW_GDMA_ROLE_PERIPH_CSI,
                                    DW_GDMA_ROLE_MEM,
                                    DW_GDMA_FLOW_CTRL_SELF);
  dw_gdma_ll_channel_set_src_handshake_interface(dev, chan,
                                                 DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_dst_handshake_interface(dev, chan,
                                                 DW_GDMA_HANDSHAKE_HW);
  dw_gdma_ll_channel_set_src_handshake_periph(dev, chan,
                                              DW_GDMA_ROLE_PERIPH_CSI);
  dw_gdma_ll_channel_set_src_multi_block_type(
    dev, chan, DW_GDMA_BLOCK_TRANSFER_CONTIGUOUS);
  dw_gdma_ll_channel_set_dst_multi_block_type(
    dev, chan, DW_GDMA_BLOCK_TRANSFER_CONTIGUOUS);
  dw_gdma_ll_channel_set_src_outstanding_limit(dev, chan, 5);
  dw_gdma_ll_channel_set_dst_outstanding_limit(dev, chan, 5);
  dw_gdma_ll_channel_set_src_periph_status_addr(dev, chan,
                                                MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_periph_status_addr(dev, chan, 0);
  dw_gdma_ll_channel_set_link_list_master_port(
    dev, chan,
    DW_GDMA_LL_MASTER_PORT_MEMORY);

  /* Direct channel register setup for first block */

  dw_gdma_ll_channel_set_src_addr(dev, chan, MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_addr(dev, chan,
    esp32p4_csi_dma_buffer_addr(priv, priv->buffers[0].payload));
  dw_gdma_ll_channel_set_trans_block_size(dev, chan, words_count);
  dw_gdma_ll_channel_set_src_master_port(dev, chan, MIPI_CSI_BRG_MEM_BASE);
  dw_gdma_ll_channel_set_dst_master_port(dev, chan,
    esp32p4_csi_dma_buffer_addr(priv, priv->buffers[0].payload));
  dw_gdma_ll_channel_set_src_trans_width(dev, chan, DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_channel_set_dst_trans_width(dev, chan, DW_GDMA_TRANS_WIDTH_64);
  dw_gdma_ll_channel_set_src_burst_items(dev, chan, DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_dst_burst_items(dev, chan, DW_GDMA_BURST_ITEMS_512);
  dw_gdma_ll_channel_set_src_burst_mode(dev, chan, DW_GDMA_BURST_MODE_FIXED);
  dw_gdma_ll_channel_set_dst_burst_mode(dev, chan,
                                        DW_GDMA_BURST_MODE_INCREMENT);
  dw_gdma_ll_channel_set_src_burst_len(dev, chan, 16);
  dw_gdma_ll_channel_set_dst_burst_len(dev, chan, 16);
  /* Poll channel completion.  The vendored shared level interrupt can
   * remain asserted after the first frame and freeze the system.
   */

  dw_gdma_ll_channel_enable_intr_propagation(dev, chan, UINT32_MAX, false);
  dw_gdma_ll_channel_clear_intr(dev, chan, UINT32_MAX);
  dw_gdma_ll_channel_enable_intr_generation(dev, chan, UINT32_MAX, true);

  priv->dma_initialized = true;
  priv->dma_running     = false;

  nxmutex_unlock(&priv->lock);
  return OK;

err_clean:
  if (priv->lli_items != NULL)
    {
      kmm_free(priv->lli_items);
      priv->lli_items = NULL;
    }

  for (i = 0; i < count; i++)
    {
      if (priv->buffers[i].raw_buf != NULL)
        {
          if (config->mem_type == ESP32P4_CSI_BUF_PSRAM)
            {
              kumm_free(priv->buffers[i].raw_buf);
            }
          else
            {
              kmm_free(priv->buffers[i].raw_buf);
            }

          priv->buffers[i].raw_buf = NULL;
        }
    }

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_csi_dma_start
 ****************************************************************************/

int esp32p4_csi_dma_start(void)
{
  FAR struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  FAR struct esp32p4_csi_buffer_s *buf_desc;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->dma_initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  if (priv->dma_running)
    {
      nxmutex_unlock(&priv->lock);
      return -EBUSY;
    }

  buf_desc = &priv->buffers[priv->current_buf_idx];
  ret = esp32p4_csi_arm_buffer(priv, buf_desc);

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_csi_dma_stop
 ****************************************************************************/

int esp32p4_csi_dma_stop(void)
{
  FAR struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  dw_gdma_dev_t *dev;
  int ret;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->dma_initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  dev = priv->dma_hal.dev;

