uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
  /* Disable channel */

  dw_gdma_ll_channel_enable(dev, priv->dma_chan, false);
  ret = esp32p4_csi_dma_wait_idle(priv);

  if (priv->initialized)
    {
      mipi_csi_brg_ll_enable(priv->hal.bridge_dev, false);
      priv->enabled = false;
    }

  priv->dma_running        = false;
  priv->stats.is_capturing = false;

  nxmutex_unlock(&priv->lock);
  return ret;
}

/****************************************************************************
 * Name: esp32p4_csi_capture_frame
 ****************************************************************************/

int esp32p4_csi_capture_frame(FAR struct esp32p4_csi_frame_s *frame,
                              uint32_t timeout_ms)
{
  FAR struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  FAR struct esp32p4_csi_buffer_s *buf_desc;
  dw_gdma_dev_t *dev;
  struct timespec abstime;
  struct timespec now;
  uint64_t nsec;
  bool guard_ok = true;
  size_t bytes_received = 0;
  uint32_t crc;
  int ret = OK;

  if (frame == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (!priv->dma_initialized)
    {
      nxmutex_unlock(&priv->lock);
      return -ENODEV;
    }

  dev      = priv->dma_hal.dev;
  buf_desc = &priv->buffers[priv->current_buf_idx];

  if (!priv->dma_running)
    {
      ret = esp32p4_csi_arm_buffer(priv, buf_desc);
      if (ret < 0)
        {
          nxmutex_unlock(&priv->lock);
          return ret;
        }
    }

  /* Calculate timeout deadline */

  clock_systime_timespec(&now);
  nsec = (uint64_t)now.tv_nsec + (uint64_t)(timeout_ms % 1000) * 1000000ULL;
  abstime.tv_sec  = now.tv_sec + (timeout_ms / 1000) +
                    (nsec / 1000000000ULL);
  abstime.tv_nsec = nsec % 1000000000ULL;

  /* In self-flow-control mode hardware clears CH_EN after exactly one
   * programmed frame. Interrupt status is sampled for errors.
   */

  while (!priv->frame_ready)
    {
      uint32_t istat =
        dw_gdma_ll_channel_get_intr_status(dev, priv->dma_chan);
      uint32_t mask = 1u << priv->dma_chan;
      uint32_t dar = dev->ch[priv->dma_chan].dar0.dar0;
      uint32_t lo = esp32p4_csi_dma_buffer_addr(priv, buf_desc->payload);

      ret = esp32p4_csi_dma_record_errors(priv, istat);
      if (ret < 0)
        {
          break;
        }

      if (dar < lo || dar > lo + buf_desc->payload_len)
        {
          printf("CSI DMA runaway: DAR=0x%08" PRIx32
                 " buffer=0x%08" PRIx32 "+%zu\n",
                 dar, lo, buf_desc->payload_len);
          priv->stats.dma_guard_errors++;
          ret = -EOVERFLOW;
          break;
        }

      if ((dev->chen0.val & mask) == 0)
        {
          bytes_received = dar - lo;
          if (bytes_received != buf_desc->payload_len)
            {
              printf("CSI DMA short frame: DAR=0x%08" PRIx32
                     " bytes=%zu/%zu\n", dar, bytes_received,
                     buf_desc->payload_len);
              ret = -EMSGSIZE;
              break;
            }

          dw_gdma_ll_channel_clear_intr(dev, priv->dma_chan, istat);
          priv->stats.frames_captured++;
          priv->stats.last_frame_time_us = esp32p4_get_time_us();
          priv->frame_ready              = true;
          priv->last_dma_status          = OK;
          break;
        }

      clock_systime_timespec(&now);
      if (now.tv_sec > abstime.tv_sec ||
          (now.tv_sec == abstime.tv_sec && now.tv_nsec >= abstime.tv_nsec))
        {
          ret = -ETIMEDOUT;
          break;
        }

      nxsig_usleep(2000); /* 2 ms poll sleep */
    }

  if (ret < 0)
    {
      uint32_t istat =
        dw_gdma_ll_channel_get_intr_status(dev, priv->dma_chan);
      uint32_t tamt =
        dw_gdma_ll_channel_get_trans_amount(dev, priv->dma_chan);
      uint32_t fifo =
        dw_gdma_ll_channel_get_fifo_remain(dev, priv->dma_chan);
      uint32_t chen = dev->chen0.val;
      uint32_t bdepth = (priv->initialized) ?
        priv->hal.bridge_dev->buf_flow_ctl.csi_buf_depth : 0;
      uint32_t bint_raw = (priv->initialized) ?
        priv->hal.bridge_dev->int_raw.val : 0;
      uint32_t bint_st = (priv->initialized) ?
        priv->hal.bridge_dev->int_st.val : 0;
      uint32_t h_main = (priv->initialized) ?
        priv->hal.host_dev->int_st_main.val : 0;
      uint32_t h_phy_f = (priv->initialized) ?
        priv->hal.host_dev->int_st_phy_fatal.val : 0;
      uint32_t h_pkt_f = (priv->initialized) ?
        priv->hal.host_dev->int_st_pkt_fatal.val : 0;
      uint32_t h_phy = (priv->initialized) ?
        priv->hal.host_dev->int_st_phy.val : 0;
      uint32_t h_did = (priv->initialized) ?
        priv->hal.host_dev->int_st_data_id.val : 0;
      uint32_t h_crc = (priv->initialized) ?
        priv->hal.host_dev->int_st_crc_frame_fatal.val : 0;
      uint32_t clk_hs = (priv->initialized) ?
        priv->hal.host_dev->phy_rx.phy_rxclkactivehs : 0;
      uint32_t clk_stop = (priv->initialized) ?
        priv->hal.host_dev->phy_stopstate.phy_stopstateclk : 0;
      uint32_t d_stop = (priv->initialized) ?
        ((priv->hal.host_dev->phy_stopstate.phy_stopstatedata_0 & 1) |
         ((priv->hal.host_dev->phy_stopstate.phy_stopstatedata_1 & 1)
          << 1)) : 0;
      uint32_t dar = dev->ch[priv->dma_chan].dar0.dar0;
      uint32_t sar = dev->ch[priv->dma_chan].sar0.sar0;
      uint32_t block_ts = dev->ch[priv->dma_chan].block_ts0.block_ts;

      /* Stop DMA channel */

      dw_gdma_ll_channel_enable(dev, priv->dma_chan, false);
      esp32p4_csi_dma_wait_idle(priv);
      if (priv->initialized)
        {
          mipi_csi_brg_ll_enable(priv->hal.bridge_dev, false);
          priv->enabled = false;
        }

      priv->dma_running        = false;
      priv->stats.is_capturing = false;

      printf("DEBUG: DMA Timeout! istat=0x%08" PRIx32 ", tamt=%" PRIu32
             ", fifo=%" PRIu32 ", chen=0x%08" PRIx32 ", bdepth=%" PRIu32
             ", brg_raw=0x%08" PRIx32 ", brg_st=0x%08" PRIx32
             ", h_main=0x%08" PRIx32 ", h_phy=0x%08" PRIx32
             ", h_did=0x%08" PRIx32 ", h_crc=0x%08" PRIx32
             ", h_phy_f=0x%08" PRIx32 ", h_pkt_f=0x%08" PRIx32
             ", clk_hs=%" PRIu32 ", clk_stop=%" PRIu32
             ", d_stop=0x%02" PRIx32 ", dar=0x%08" PRIx32
             ", sar=0x%08" PRIx32 ", ts=%" PRIu32 "\n",
             istat, tamt, fifo, chen, bdepth, bint_raw, bint_st,
             h_main, h_phy, h_did, h_crc, h_phy_f, h_pkt_f,
             clk_hs, clk_stop, d_stop, dar, sar, block_ts);

      if (priv->initialized)
        {
          printf("  CSI Host: ver=0x%08" PRIx32 " lanes=0x%08" PRIx32
                 " rstn=0x%08" PRIx32 " rx=0x%08" PRIx32
                 " stop=0x%08" PRIx32 "\n"
                 "            tst0=0x%08" PRIx32 " tst1=0x%08" PRIx32
                 " vcx=0x%08" PRIx32 "\n",
                 (uint32_t)priv->hal.host_dev->version.val,
                 (uint32_t)priv->hal.host_dev->n_lanes.val,
                 (uint32_t)priv->hal.host_dev->csi2_resetn.val,
                 (uint32_t)priv->hal.host_dev->phy_rx.val,
                 (uint32_t)priv->hal.host_dev->phy_stopstate.val,
                 (uint32_t)priv->hal.host_dev->phy_test_ctrl0.val,
                 (uint32_t)priv->hal.host_dev->phy_test_ctrl1.val,
                 (uint32_t)priv->hal.host_dev->vc_extension.val);

          printf("  CSI Brg : clk=0x%08" PRIx32 " en=0x%08" PRIx32
                 " dma_cfg=0x%08" PRIx32 " buf=0x%08" PRIx32 "\n"
                 "            dt=0x%08" PRIx32 " frm=0x%08" PRIx32
                 " end=0x%08" PRIx32 " blk=0x%08" PRIx32 "\n"
                 "            h_ctrl=0x%08" PRIx32 " h_cm=0x%08" PRIx32
                 " h_sz=0x%08" PRIx32 "\n",
                 (uint32_t)priv->hal.bridge_dev->clk_en.val,
                 (uint32_t)priv->hal.bridge_dev->csi_en.val,
                 (uint32_t)priv->hal.bridge_dev->dma_req_cfg.val,
                 (uint32_t)priv->hal.bridge_dev->buf_flow_ctl.val,
                 (uint32_t)priv->hal.bridge_dev->data_type_cfg.val,
                 (uint32_t)priv->hal.bridge_dev->frame_cfg.val,
                 (uint32_t)priv->hal.bridge_dev->endian_mode.val,
                 (uint32_t)priv->hal.bridge_dev->dmablk_size.val,
                 (uint32_t)priv->hal.bridge_dev->host_ctrl.val,
                 (uint32_t)priv->hal.bridge_dev->host_cm_ctrl.val,
                 (uint32_t)priv->hal.bridge_dev->host_size_ctrl.val);

          printf("  DW-GDMA : ctl0=0x%08" PRIx32 " ctl1=0x%08" PRIx32
                 " cfg0=0x%08" PRIx32 " cfg1=0x%08" PRIx32 "\n",
                 (uint32_t)dev->ch[priv->dma_chan].ctl0.val,
                 (uint32_t)dev->ch[priv->dma_chan].ctl1.val,
                 (uint32_t)dev->ch[priv->dma_chan].cfg0.val,
                 (uint32_t)dev->ch[priv->dma_chan].cfg1.val);
        }

      fflush(stdout);

      priv->stats.dma_timeouts++;
      nxmutex_unlock(&priv->lock);
      return ret;
    }

  /* Stop DMA channel */

