uleemos/nuttx/arch/risc-v/src/esp32p4/esp32p4_mipi_csi.c
  dw_gdma_ll_channel_enable(dev, priv->dma_chan, false);
  esp32p4_csi_dma_wait_idle(priv);
  if (priv->initialized)
    {
      mipi_csi_brg_ll_enable(priv->hal.bridge_dev, false);
      priv->enabled = false;
    }

  priv->dma_running        = false;
  priv->stats.is_capturing = false;

  if (priv->last_dma_status != OK)
    {
      nxmutex_unlock(&priv->lock);
      return priv->last_dma_status;
    }

  /* Invalidate cache so CPU reads freshly captured data from PSRAM/SRAM */

  esp32p4_csi_cache_invalidate(buf_desc->payload,
                               buf_desc->payload_len);

  /* Verify front and rear guard patterns */

  if (buf_desc->has_guard)
    {
      uint32_t front = *(FAR uint32_t *)buf_desc->raw_buf;
      uint32_t rear  = *(FAR uint32_t *)(buf_desc->payload +
                                         buf_desc->payload_len);

      if (front != ESP32P4_CSI_GUARD_FRONT || rear != ESP32P4_CSI_GUARD_REAR)
        {
          priv->stats.dma_guard_errors++;
          guard_ok = false;
        }
    }

  /* Calculate CRC32 checksum over the payload */

  crc = crc32((FAR const uint8_t *)buf_desc->payload,
              buf_desc->payload_len);

  /* Populate output frame structure */

  frame->seq_no         = priv->stats.frames_captured;
  frame->timestamp_us   = priv->stats.last_frame_time_us;
  frame->buffer         = buf_desc->payload;
  frame->buflen         = buf_desc->payload_len;
  frame->bytes_received = bytes_received;
  frame->crc32          = crc;
  frame->guard_valid    = guard_ok;
  frame->status         = OK;

  /* Switch to next buffer for multi-buffer modes */

  priv->current_buf_idx = (priv->current_buf_idx + 1) % priv->buf_count;

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_get_dma_stats
 ****************************************************************************/

int esp32p4_csi_get_dma_stats(FAR struct esp32p4_csi_dma_stats_s *stats)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  int ret;

  if (stats == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  memcpy(stats, &priv->stats, sizeof(*stats));

  nxmutex_unlock(&priv->lock);
  return OK;
}

/****************************************************************************
 * Name: esp32p4_csi_reset_dma_stats
 ****************************************************************************/

void esp32p4_csi_reset_dma_stats(void)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  size_t bytes;
  uint8_t chan;

  if (nxmutex_lock(&priv->lock) < 0)
    {
      return;
    }

  bytes = priv->stats.frame_bytes;
  chan  = priv->stats.active_channel;
  memset(&priv->stats, 0, sizeof(priv->stats));
  priv->stats.frame_bytes    = bytes;
  priv->stats.active_channel = chan;

  nxmutex_unlock(&priv->lock);
}

/****************************************************************************
 * Name: esp32p4_csi_dump_dma
 ****************************************************************************/

void esp32p4_csi_dump_dma(void)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  struct esp32p4_csi_dma_stats_s st;
  dw_gdma_dev_t *dev;
  uint32_t chen;
  uint32_t int_st;
  int ret;
  int i;

  ret = esp32p4_csi_get_dma_stats(&st);
  if (ret < 0)
    {
      printf("CSI DMA: get stats failed (%d)\n", ret);
      return;
    }

  dev = priv->dma_hal.dev;
  chen   = (dev != NULL) ? dev->chen0.val : 0;
  int_st = (dev != NULL) ?
           dw_gdma_ll_channel_get_intr_status(dev, priv->dma_chan) : 0;

  printf("========================================\n");
  printf(" ESP32-P4 CSI DW-GDMA Channel Status\n");
  printf("========================================\n");
  printf("  DMA Initialized : %s\n", priv->dma_initialized ? "YES" : "NO");
  printf("  DMA Running     : %s\n", priv->dma_running ? "YES" : "NO");
  printf("  Channel Number  : %u\n", priv->dma_chan);
  printf("  Buffer Count    : %u\n", priv->buf_count);
  printf("  Memory Type     : %s\n",
         (priv->dma_cfg.mem_type == ESP32P4_CSI_BUF_PSRAM) ?
         "PSRAM" : "Internal SRAM");
  printf("  Expected Frame  : %" PRIu32 " bytes\n", st.frame_bytes);
  printf("  Guard Enabled   : %s\n",
         priv->dma_cfg.enable_guard ? "YES" : "NO");
  printf("  Hardware CHEN0  : 0x%08" PRIx32 "\n", chen);
  printf("  Channel INT ST0 : 0x%08" PRIx32 "\n", int_st);
  printf("----------------------------------------\n");
  printf(" Buffer & Descriptor Layout:\n");
  for (i = 0; i < priv->buf_count; i++)
    {
      printf("  Buf[%d]: raw=%p, payload=%p, len=%zu\n",
             i, priv->buffers[i].raw_buf,
             priv->buffers[i].payload, priv->buffers[i].payload_len);
      if (priv->lli_items != NULL)
        {
          printf("  LLI[%d]: @%p (sar=0x%08" PRIx32 ", dar=0x%08" PRIx32
                 ", block_ts=%" PRIu32 ")\n",
                 i, &priv->lli_items[i],
                 (uint32_t)priv->lli_items[i].sar_lo.sar0,
                 (uint32_t)priv->lli_items[i].dar_lo.dar0,
                 (uint32_t)priv->lli_items[i].block_ts_lo.block_ts + 1);
        }
    }

  printf("----------------------------------------\n");
  printf(" Diagnostic Statistics:\n");
  printf("  Frames Captured : %" PRIu32 "\n", st.frames_captured);
  printf("  Frames Dropped  : %" PRIu32 "\n", st.frames_dropped);
  printf("  DMA Timeouts    : %" PRIu32 "\n", st.dma_timeouts);
  printf("  Decode Errors   : %" PRIu32 "\n", st.dma_err_dec);
  printf("  Slave Errors    : %" PRIu32 "\n", st.dma_err_slv);
  printf("  LLI Errors      : %" PRIu32 "\n", st.dma_err_lli);
  printf("  Guard Errors    : %" PRIu32 "\n", st.dma_guard_errors);
  printf("  Last Frame Time : %" PRIu64 " us\n", st.last_frame_time_us);
  printf("========================================\n");
}

/****************************************************************************
 * Name: esp32p4_csi_dma_deinit
 ****************************************************************************/

int esp32p4_csi_dma_deinit(void)
{
  struct esp32p4_csi_dev_s *priv = &g_csi_dev;
  dw_gdma_dev_t *dev;
  int ret;
  int i;

  ret = nxmutex_lock(&priv->lock);
  if (ret < 0)
    {
      return ret;
    }

  if (priv->dma_initialized)
    {
      dev = priv->dma_hal.dev;

      /* Disable channel and interrupts */

      if (dev != NULL)
        {
          dw_gdma_ll_channel_enable(dev, priv->dma_chan, false);
          dw_gdma_ll_channel_enable_intr_propagation(dev, priv->dma_chan,
                                                     UINT32_MAX, false);
          dw_gdma_ll_channel_clear_intr(dev, priv->dma_chan, UINT32_MAX);
        }

      if (priv->cpuint >= 0)
        {
          up_disable_irq(ESP_SOURCE2IRQ(DW_GDMA_INTR_SOURCE));
          esp_teardown_irq(DW_GDMA_INTR_SOURCE, priv->cpuint);
          priv->cpuint = -1;
        }

      /* Free LLI items */

      if (priv->lli_items != NULL)
        {
          kmm_free(priv->lli_items);
          priv->lli_items = NULL;
        }

      /* Free frame buffers */

      for (i = 0; i < priv->buf_count; i++)
        {
          if (priv->buffers[i].raw_buf != NULL)
            {
              if (priv->dma_cfg.mem_type == ESP32P4_CSI_BUF_PSRAM)
                {
                  kumm_free(priv->buffers[i].raw_buf);
                }
              else
                {
                  kmm_free(priv->buffers[i].raw_buf);
                }

              priv->buffers[i].raw_buf = NULL;
            }
        }

      priv->dma_initialized = false;
      priv->dma_running     = false;
    }

  nxmutex_unlock(&priv->lock);
  return OK;
}
